Tekla Open API Reference for Tekla Structures 2025
PartAttributes Properties
The Part.PartAttributes type exposes the following members.
Properties
Name | Description
CenterLine
 The line type of the center line.
CustomPresentation
 Custom presentation GUID to be applied to the object type
DrawCenterLine
 True if the center line is drawn.
DrawChamfers
 True if chamfers are drawn.
DrawConnectingSideMarks
 True if connecting side marks are drawn.
DrawHiddenLines
 True if hidden lines are drawn.
DrawOrientationMark
 True if the orientation mark is drawn.
DrawOwnHiddenLines
 True if own hidden lines are drawn.
DrawPopMarks
 True if pop marks are drawn.
DrawReferenceLine
 True if the reference line is drawn.
FaceHatch
 The hatch type of the face hatch.
HiddenLines
 The line type of hidden lines.
OwnHiddenLines
 The line type of own hidden lines.
PartialProfileLength
 Gets or sets the partial profile length.
PartialProfileOffset
 Gets or sets the partial profile offset.
ReferenceLine
 The line type of the reference line.
Representation
 The representation of the part.
SectionFaceHatch
 The hatch type of the section face hatch.
SectionLines
 The line type of section lines.
SymbolOffset
 The symbol offset.
VisibleLines
 The line type of visible lines.
Top
See Also
Reference
Part.PartAttributes Class
Tekla.Structures.Drawing Namespace